{"keras_version": "2.1.6", "config": {"name": "model_1", "output_layers": [["dense_5", 0, 0]], "layers": [{"name": "input_1", "config": {"batch_input_shape": [null, 20], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "dense_1", "config": {"bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "normal", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 40, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_2", "config": {"bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "normal", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 80, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_3", "config": {"bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "normal", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 80, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_4", "config": {"bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "normal", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "dense_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 20, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu"}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_5", "config": {"bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "normal", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "dense_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "kernel_constraint": null, "activity_regularizer": null, "activation": "sigmoid"}, "inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}