{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.6", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"batch_input_shape": [null, 21], "dtype": "float32", "name": "input_1", "sparse": false}}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 80, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "relu", "kernel_constraint": null, "name": "dense_1"}}, {"class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "relu", "kernel_constraint": null, "name": "dense_2"}}, {"class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "relu", "kernel_constraint": null, "name": "dense_3"}}, {"class_name": "Dense", "name": "dense_4", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 80, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "relu", "kernel_constraint": null, "name": "dense_4"}}, {"class_name": "Dense", "name": "dense_5", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "tanh", "kernel_constraint": null, "name": "dense_5"}}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_5", 0, 0]]}}