{"backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_5", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 20]}, "inbound_nodes": []}, {"class_name": "Dense", "name": "dense_1", "config": {"activity_regularizer": null, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 80, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "normal"}}}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"activity_regularizer": null, "kernel_constraint": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 100, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "normal"}}}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"activity_regularizer": null, "kernel_constraint": null, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 100, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "normal"}}}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_4", "config": {"activity_regularizer": null, "kernel_constraint": null, "name": "dense_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 80, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "normal"}}}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_5", "config": {"activity_regularizer": null, "kernel_constraint": null, "name": "dense_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 1, "activation": "tanh", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "normal"}}}, "inbound_nodes": [[["dense_4", 0, 0, {}]]]}]}, "keras_version": "2.1.6", "class_name": "Model"}