{"class_name": "Model", "backend": "tensorflow", "config": {"output_layers": [["dense_5", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 20], "name": "input_1", "sparse": false}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Dense", "config": {"units": 80, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "kernel_constraint": null}, "name": "dense_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"units": 100, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "kernel_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"units": 100, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "kernel_constraint": null}, "name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"units": 80, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "kernel_constraint": null}, "name": "dense_4", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"units": 1, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "tanh", "kernel_constraint": null}, "name": "dense_5", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.1.6"}