{"backend": "tensorflow", "keras_version": "2.1.6", "class_name": "Model", "config": {"layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 20], "name": "input_1", "dtype": "float32"}}, {"name": "dense_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 100, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "bias_constraint": null, "activity_regularizer": null, "use_bias": true}}, {"name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 200, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_2", "bias_constraint": null, "activity_regularizer": null, "use_bias": true}}, {"name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 200, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_3", "bias_constraint": null, "activity_regularizer": null, "use_bias": true}}, {"name": "dense_4", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 50, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_4", "bias_constraint": null, "activity_regularizer": null, "use_bias": true}}, {"name": "dense_5", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 1, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_5", "bias_constraint": null, "activity_regularizer": null, "use_bias": true}}], "output_layers": [["dense_5", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}}