{"config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, 20]}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 100, "activation": "relu", "kernel_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 200, "activation": "relu", "kernel_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 200, "activation": "relu", "kernel_regularizer": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dense_3", "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 50, "activation": "relu", "kernel_regularizer": null}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "dense_4", "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_5", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 1, "activation": "tanh", "kernel_regularizer": null}, "inbound_nodes": [[["dense_4", 0, 0, {}]]], "name": "dense_5", "class_name": "Dense"}], "output_layers": [["dense_5", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.6"}